app/controllers/posts_controller.rb

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."post_id" = $2 LIMIT $3  [["user_id", 3], ["post_id", 1], ["LIMIT", 1]]
---
  def show
    @favorite = current_user.favorites.find_by(post_id: @post.id)

INSERT INTO "posts" ("content", "created_at", "updated_at", "avatar", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "aaa"], ["created_at", "2021-05-15 09:05:52.251541"], ["updated_at", "2021-05-15 09:05:52.251541"], ["avatar", "500.png"], ["user_id", 1]]
---
  def create
    @post = current_user.posts.build(post_params)

    if params[:back]
      render :new
    else
      if @post.save

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 32]]
---
  def destroy

    if @post.user != current_user
      flash.now[:error] = 'unauthorized access!'
      redirect_to posts_path
    else

    @post.destroy