app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "password_digest" = $2, "avatar1" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["name", "mo"], ["password_digest", "$2a$12$bC3xxLLhpjbhm/xTIFQ8tu0gvwWllxnUesad.ZdqBCtYl3FRAUghS"], ["avatar1", "Bella-Agossou-2-1.jpg"], ["updated_at", "2021-05-26 09:50:18.662727"], ["id", 23]]
---
  def update
     @user = User.find(params[:id])
    if @user.update(user_params)